---==================================================================================================----
---=========================ЗАДАНИЕ 2=========================================================================----
---==================================================================================================----

/*--
 * Написать SELECT-запросы, которые выведут информацию согласно инструкциям ниже.

Внимание: результаты запросов не должны быть пустыми, учтите это при заполнении таблиц.

   1) Название и продолжительность самого длительного трека.
   2) Название треков, продолжительность которых не менее 3,5 минут.
   3) Названия сборников, вышедших в период с 2018 по 2020 год включительно.
   4)  Исполнители, чьё имя состоит из одного слова.
   5)  Название треков, которые содержат слово «мой» или «my».

 * 
 * --*/

 ---------1) Название и продолжительность самого длительного трека.

SELECT Title, Duration
FROM Track
WHERE Duration = (SELECT MAX(Duration) FROM Track);

----------2) Название треков, продолжительность которых не менее 3,5 минут. (А значит не менее 210 секунд)

SELECT Title, Duration
FROM Track
WHERE Duration >= 210;

----------3) Названия сборников, вышедших в период с 2018 по 2020 год включительно.

SELECT Title, ReleaseYear
FROM Compilation
WHERE ReleaseYear BETWEEN 2018 AND 2020;

-----------4) Исполнители, чьё имя состоит из одного слова.

SELECT Nickname
FROM Author
WHERE Nickname NOT LIKE '% %';
------------5) Название треков, которые содержат слово «мой» или «my».
SELECT Title
FROM Track
WHERE LOWER(Title) LIKE '%мой%' ---- приводим название к нижнему регистру, чтобы поиск был не чувствителен к нему
   OR LOWER(Title) LIKE '%my%';  ---- ищет вхождение "my" или "мой"
----!!!Но если я праввильно понял задание и мы говорим о конкретном слове, то:
   
   SELECT Title
FROM Track
WHERE Title ~* '\mмой\M'    -- \m и \M — границы слова
   OR Title ~* '\mmy\M';
 
---==================================================================================================----
---==================================================================================================----
---==================================================================================================----
---==================================================================================================----
